; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v4 ?v7)
             (pred_8 ?v9 ?v6)
             (pred_9 ?v4 ?v6)
             (pred_1 ?v11 ?v4 )
	     (pred_2 ?v4)
             (pred_10 ?v8)
             (pred_3 ?v9)
             (pred_7 ?v6)
             (pred_12 ?v4)
             (pred_11 ?v9)
             (pred_6 ?v4)
             (pred_4 ))



(:action op_4
:parameters (?v5 ?v2 ?v1 ?v3)
:precondition (and (pred_10 ?v5) (pred_10 ?v2) (pred_3 ?v1) (pred_7 ?v3)
          (pred_5 ?v5 ?v2) (pred_8 ?v1 ?v3)
                   (pred_9 ?v2 ?v3) (pred_2 ?v5) 
                   (pred_12 ?v2) (pred_11 ?v1))
:effect (and  (pred_6 ?v2) (not (pred_12 ?v2))))


(:action op_3
:parameters (?v5 ?v13)
:precondition (and (pred_10 ?v5) (pred_10 ?v13)
               (pred_2 ?v5) (pred_5 ?v5 ?v13) (pred_6 ?v13))
:effect (and (pred_2 ?v13) (not (pred_2 ?v5))))

(:action op_2
:parameters (?v5 ?v1)
:precondition (and (pred_10 ?v5) (pred_3 ?v1) 
                  (pred_2 ?v5) (pred_1 ?v1 ?v5) (pred_4 ))
:effect (and (pred_11 ?v1)
   (not (pred_1 ?v1 ?v5)) (not (pred_4 ))))


(:action op_1
:parameters (?v5 ?v10 ?v12)
:precondition (and (pred_10 ?v5) (pred_3 ?v10) (pred_3 ?v12)
                  (pred_2 ?v5) (pred_11 ?v12) (pred_1 ?v10 ?v5))
:effect (and (pred_11 ?v10) (pred_1 ?v12 ?v5)
        (not (pred_11 ?v12)) (not (pred_1 ?v10 ?v5))))

(:action op_5
:parameters (?v5 ?v1)
:precondition (and (pred_10 ?v5) (pred_3 ?v1) 
                  (pred_2 ?v5) (pred_11 ?v1))
:effect (and (pred_4 ) (pred_1 ?v1 ?v5) (not (pred_11 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_20 obj_12 obj_08 obj_06 obj_16 obj_18 obj_05 obj_10 obj_03 obj_01 obj_07 obj_11 obj_17 obj_14 obj_09
    obj_02 obj_04
    obj_15 obj_19
    )

    (:init
       (pred_4)

       (pred_10 obj_13)
       (pred_10 obj_20)
       (pred_10 obj_12)
       (pred_10 obj_08)
       (pred_10 obj_06)
       (pred_10 obj_16)
       (pred_10 obj_18)
       (pred_10 obj_05)
       (pred_10 obj_10)
       (pred_10 obj_03)
       (pred_10 obj_01)
       (pred_10 obj_07)
       (pred_10 obj_11)
       (pred_10 obj_17)
       (pred_10 obj_14)
       (pred_10 obj_09)
       (pred_7 obj_02)
       (pred_7 obj_04)
       (pred_3 obj_15)
       (pred_3 obj_19)

       (pred_5 obj_13 obj_06)
       (pred_5 obj_13 obj_20)
       (pred_5 obj_20 obj_16)
       (pred_5 obj_20 obj_12)
       (pred_5 obj_20 obj_13)
       (pred_5 obj_12 obj_18)
       (pred_5 obj_12 obj_08)
       (pred_5 obj_12 obj_20)
       (pred_5 obj_08 obj_05)
       (pred_5 obj_08 obj_12)
       (pred_5 obj_06 obj_10)
       (pred_5 obj_06 obj_16)
       (pred_5 obj_06 obj_13)
       (pred_5 obj_16 obj_03)
       (pred_5 obj_16 obj_18)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_16 obj_06)
       (pred_5 obj_18 obj_01)
       (pred_5 obj_18 obj_05)
       (pred_5 obj_18 obj_12)
       (pred_5 obj_18 obj_16)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_05 obj_08)
       (pred_5 obj_05 obj_18)
       (pred_5 obj_10 obj_11)
       (pred_5 obj_10 obj_03)
       (pred_5 obj_10 obj_06)
       (pred_5 obj_03 obj_17)
       (pred_5 obj_03 obj_01)
       (pred_5 obj_03 obj_16)
       (pred_5 obj_03 obj_10)
       (pred_5 obj_01 obj_14)
       (pred_5 obj_01 obj_07)
       (pred_5 obj_01 obj_18)
       (pred_5 obj_01 obj_03)
       (pred_5 obj_07 obj_09)
       (pred_5 obj_07 obj_05)
       (pred_5 obj_07 obj_01)
       (pred_5 obj_11 obj_17)
       (pred_5 obj_11 obj_10)
       (pred_5 obj_17 obj_14)
       (pred_5 obj_17 obj_03)
       (pred_5 obj_17 obj_11)
       (pred_5 obj_14 obj_09)
       (pred_5 obj_14 obj_01)
       (pred_5 obj_14 obj_17)
       (pred_5 obj_09 obj_07)
       (pred_5 obj_09 obj_14)
       (pred_12 obj_20)
       (pred_12 obj_03)
       (pred_9  obj_20 obj_02)
       (pred_9  obj_03 obj_04)
       (pred_6 obj_13)
       (pred_6 obj_12)
       (pred_6 obj_08)
       (pred_6 obj_06)
       (pred_6 obj_16)
       (pred_6 obj_18)
       (pred_6 obj_05)
       (pred_6 obj_10)
       (pred_6 obj_01)
       (pred_6 obj_07)
       (pred_6 obj_11)
       (pred_6 obj_17)
       (pred_6 obj_14)
       (pred_6 obj_09)

       (pred_8  obj_15 obj_02)
       (pred_8  obj_19 obj_04)
       (pred_1 obj_15 obj_12)
       (pred_1 obj_19 obj_01)
       (pred_2 obj_07)
    )

    (:goal (and
       (pred_1 obj_15 obj_20)
    ))
(:constraints
  (always (not (pred_2 obj_05)))
)
)

; plan
1. (op_3 obj_07 obj_01)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_01)
   goals met: 0 of 1
2. (op_3 obj_01 obj_18)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_18)
   goals met: 0 of 1
3. (op_3 obj_18 obj_12)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_12)
   goals met: 0 of 1
4. (op_2 obj_12 obj_15)
   deleted: (pred_1 obj_15 obj_12) (pred_4)
   added: (pred_11 obj_15)
   goals met: 0 of 1
5. (op_4 obj_12 obj_20 obj_15 obj_02)
   deleted: (pred_12 obj_20)
   added: (pred_6 obj_20)
   goals met: 0 of 1
6. (op_3 obj_12 obj_20)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_20)
   goals met: 0 of 1
7. (op_5 obj_20 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_4) (pred_1 obj_15 obj_20)
   goals met: 1 of 1
